{
  "toast": {
    "email": {
      "success": "Email úspešně odeslán",
      "failure": {
        "sender": "Neplatná emailová adresa",
        "message": "Neplatná zpráva",
        "default": "Nepodařilo se odeslat email"
      }
    }
  },

  "welcomePage": {
    "mainContent": "Zdravím, jsem softwarový inženýr se zájmem o web development.",
    "primaryAction": "Čím se zabývám",
    "secondaryAction": "Stáhnout životopis",
    "picAlt": "Profilový obrázek",
    "cvLang": "cs",
    "name": "Aneta Potomská"
  },

  "navPaths": {
    "about": "O mně",
    "projects": "Projekty",
    "skills": "Dovednosti",
    "education": "Vzdělání",
    "contact": "Kontakt"
  },

  "footer": {
    "footerText": "Aplikace byla napsána pomocí: Next.js, TypeScript a Bootstrap. Návrh byl vytvořen pomocí: Figma.",
    "name": "Aneta Potomská",
    "icons": {
      "email": "Napište mi",
      "linkedin": "Linkedin",
      "github": "GitHub"
    }
  },

  "themeToggle": {
    "sunIcon": "Tmavý režim",
    "moonIcon": "Světlý režim"
  },

  "languageSelect": {
    "en": "Angličtina",
    "cs": "Čeština",
    "label": "Výběr jazyka"
  },

  "cardFooter": {
    "about": "Pro stránku",
    "src": "Zdrojový kód",
    "live": "Stránka projektu",
    "moreInfo": "Více infromací"
  },

  "projects": {
    "portfolio": {
      "label": "Portfolio",
      "content": "Webová stránka obsahující základní informace o mě.",
      "imgAlt": "Úvodní stránka mého portfolia",
      "details": {
        "paragraphs": [
          "Vytvořila jsem si pro sebe vlastní webovou stránku, přesně tu na které se teď nacházíte. Jedná se vlastně o první webovou stránku, kterou jsem tvořila od úplného začátku (tím, že jsem předtím, vždy přebírala už nějak vyvtořený projekt). Nejdříve jsem si vytvořila návrh ve Figmě. Pro barevnou paletu jsem použila webové stránky coolors a realtimecolors.",
          "Samotný kód jsme psala v již pro mě známém Next.js. Snažila jsem se naučit psát si většinu funkcionalit sama. Takže sice v aplikaci využívám Bootstrap, ale spíše častěji se spoléhám na mnou napsaná CSS. Asi nejobtížnější bylo se naučit, jak zprovoznit výběr jazyka a barevného motivu. Pro změnu jazyka jsem využila knihovnu next-intl."
        ],
        "technologies": ["TYPESCRIPT", "NEXT.JS", "HTML", "CSS", "FIGMA"],
        "time": "srpen - září 2024"
      }
    },
    "summerjob": {
      "label": "SummerJob",
      "content": "V rámci své bakalářské práce jsem pro dobrovolnickou brigádu SummerJob provedla rozvoj webové stránky pro správu akce.",
      "imgAlt": "Detaily příspěvku z nástěnky SummerJob",
      "details": {
        "paragraphs": [
          "V rámci své bakalářské práce jsem rozvinnula již existující aplikaci pro dobrovolnickou brigádu SummerJob. Cílem této aplikace je pomoc organizátorům dohlížet na průběh akce. Součástí je například přehledná evidence brigádníků, prací, míst, ročníků a dále pak plánovač, který generuje optimální plán pro daný den.",
          "Já jsem konkrétně do aplikace přidala nástěnku, aby tak měli organizátoři možnost svým uživatelům sdělit důležité novinky. Kromě toho jsem opravila nemalý počet chyb a přidala nové funkcionality - například výběr místa z mapy, nahrávání a zobrazení fotografií a celkově jsem vylepšila vzhled a funkcionalitu formulářů.",
          "Práce byly prováděny na frontendu (celkové zlepšení UI/UX), backendu a na schématu databáze. V rámci projektu byl proveden sběr a analýza požadavků (ER konceptuální model), návrh (Figma), programování (viz níže) a testování (SuperTest, Chai, Mocha, testování použitelnosti)."
        ],
        "technologies": ["TYPESCRIPT", "NEXT.JS", "PRISMA", "POSTGRESQL", "HTML", "CSS", "FIGMA"],
        "time": "leden - červen 2024"
      }
    },
    "asciiart": {
      "label": "Ascii Art",
      "content": "Převodník libovolného obrázku na ASCII art podobu.",
      "imgAlt": "Příklad použití Ascii Art převodníku",
      "details": {
        "paragraphs": [
          "Projekt je především zaměřen na správné dodržování OOP principů a testování všech částí aplikace. Hlavní snahou při psaní tohoto programu je modulárnost jednotlivých částí a dodržování GRASP vysoké soudržnosti a nízké provázanosti. Složky projektu jsou uspořádany do přeheldné struktury.",
          "Program je možné spustit v sbt shellu. Při spuštění je možnost přidat argumenty pro napříkald změnu konverzní tabulky, přidání filtrů (obrácení přes osu, světlost), místo uložení. Převodník funguje tak, že dodaný obrázek převede na černobílou verzi a poté každému pixelu přiřadí hodnotu podle tabulky převodu."
        ],
        "technologies": ["SCALA", "MOCKITO"],
        "time": "září 2023"
      }
    },
    "java": {
      "label": "Webová aplikace",
      "content": "Primitivní systém pro studijní oddělení pro evidenci studentů, předmětů a studijních materiálů.",
      "imgAlt": "Přidání studenta v aplikaci",
      "details": {
        "paragraphs": [
          "V projektu je udržovaná třívrstvá architektura. Aplikace se především orientuje na správně napsaný backend. Konkrétně se zde například využívá vzor Controller-Service-Repository. Pro ukládání dat se používá Postgresová databáze. V databázi jsou uloženy pouze 3 tabulky, ale jsou mezi nimi demonstrovány všechny typy vazeb podle kardinality (1:1, 1:N, M:N).",
          "Frontend je napsaný ve frameworku Vue.js. Frontend byl pro aplikaci až druhotný. Kód by potřeboval refaktorizaci, ale pro potřeby projektu je dostatečně funkční a přehledný."
        ],
        "technologies": ["JAVA", "POSTGRESQL", "VUE.JS"],
        "time": "srpen - září 2023"
      }
    },
    "bomberman": {
      "label": "Hra Bomberman",
      "content": "Hra spustitelná v terminálu na motivy oblíbené hry Bomberman.",
      "imgAlt": "Level pro 4 hráče",
      "details": {
        "paragraphs": [
          "Projekt je volně inspirovaný hrou Bomberman, kde je hlavním cílem pokládat bomby, ničit bedny a nepřátele. Hráči se střídají ve svých tazích, jedná se tedy o hru s tahovým režimem. Ve svém tahu hráč může udělat jednu z následujícího: pohnout se, položit bombu nebo použít detonátor.",
          "Hra je spustitelná v terminálu. Dovoluje hrát 2 až 4 hráčům. Respektive jsou ve hře dva režimy HUMAN vs HUMAN a HUMAN vs PC, kdy v prvním režimu hrají proti sobě 2 hráči na jedné klávesnici a v druhém hraje jeden hráč proti až třem umělým inteligencím. Pro hru byly napsány dvě AI, jeden optimalizuje na získání, co největšího skóre a druhý se především soustředí na rozbití beden. V základu fungují podle algoritmu pro hledání nejkratší cesty.",
          "Hra je částečně modifikovatelná prostřednictvím konfiguračních souborů. Přičemž si takto uživatel může přidat nové levely, upravit ovládání, šance na padnutí bonusů z rozbiitých beden, systém rozdělování bodů a počáteční statistiky každého hráče. V projektu bylo nutné demonstrovat použití polymorfismu. Ten se vyskytuje v rámci ovládání hráčů a úpravy efektů bonusů."
        ],
        "technologies": ["C++", "NCURSES"],
        "time": "duben - květen 2023"
      }
    },
    "vue": {
      "label": "Týmový projekt",
      "content": "V rámci 6 členného týmu jsme upravovali frontend napsaný ve Vue.js. Moje role byla především vytváření návrhů ve Figmě.",
      "imgAlt": "Použité technologie v týmovém projektu",
      "details": {
        "paragraphs": [
          "V rámci dvou semestrů na bakalářském studiu jsme s 6 členným týmem upravovali frontend napsaný ve Vue.js do projektu společnosti Jagu. Kvůli podepsanému NDA s touto firmou se budu soustředit na aspekty práce v týmu a mé role v něm.",
          "V týmu jsme měli týmového vedoucího, který dohlížel na dodržování termínů (v každém semestru jsme měli asi kolem 5 iterací). Zbytek týmu jsme si přerozdělovali úkoly na základě dohody s týmem a vyučujícím. Pro evidenci úkolů jsme používali Redmine. Současně jsme Redmine používali pro udržování wiki, kde jsme každý psali články. Kromě článků k zprovoznění, diagramům a úkolům jsem sepsala tutoriál na používání Figmy pro další týmy, kteří budou na projektu pracovat po nás.",
          "Já jsem se v týmu v prvním semestru především soustředila na vytváření návrhů ve Figmě a vyvtáření OntoUML schémat v programu Enterprise Architect. Ve figmě jsem vytvořila znovupoužitelné komponenty, návrhy vzhledu a funkcionalit a spustitelné prototypy. V Enterprise Architect jsem vytvořila diagram aktivit, doménový model a stavový model.",
          "V druhém semestru jsme migrovali z Vue 2 na Vue 3. Po tomto jsem prošla celou webovou aplikaci, na základě čehož jsem pro tým vytvořila úkoly. Já jsem osobně opravila nemalý počet chyb."
        ],
        "technologies": ["VUE.JS", "TYPESCRIPT", "FIGMA", "ENTERPRISE ARCHITECT"],
        "time": "únor - listopad 2023"
      }
    }
  },

  "aboutPage": {
    "education": {
      "paragraphs": [
        "Jsem Aneta Potomská čerstvý absolvent (2024) bakalářského programu Informatika specializace Sofwarové inženýrství z FIT ČVUT. Poslední tři roky byla tato škola pro mě to hlavní čemu jsem se věnovala a co mě nasměrovalo na moji budoucí kariéru v softwarovém vývoji. Před touto školou jsem měla minimální zkušenosti, takže jsem své roky na fakultě věnovala intenzivnímu sebezlepšování.",
        "Po získání červeného diplomu si teď mohu říct, že se mé snahy vyplatily. Škola mě sice donutila pracovat na spoustě různých projektech, ale až teď si připadám skutečně připravená pracovat na něčem větším - ať už se jedná například o mé soukromé projekty jako je tato webová stránka, nebo práce v zaměstnání."
      ],
      "imgAlt": "Logo FIT ČVUT",
      "header": "Bakalářské studium"
    },

    "hobbies": {
      "paragraphs": [
        "Pokračuji však ve sebevzdělávání i nadále. Aktuálně jsem v prvním ročníku navazujícího studia ve specializaci Softwarové inženýrství na FIT ČVUT. Učit se nové věci a zlepšovat mě prostě baví.",
        "Baví mě se zlepšovat i v jiných oblastech než jenom v IT. Ve volném čase se věnuji malbě a kresbě ať už digitální nebo tradiční. Konkrétně jsem se v tradiční tvorbě vzdělala i formálně. Důkazem toho je diplom z lidové školy LKMŠ Ostrava. V IT tuto mou zálibu využívám například při designu. A nemusí jít jenom o grafický design webových stránek. Své uplatnění se najde i při samotném návrhu programů, protože to potřebuje značnou dávku kreativity."
      ],
      "imgAlt": "Digitální autoportrét",
      "header": "Záliby"
    }
  },

  "skillsPage": [
    {
      "header": "Programování",
      "list": ["C", "C++", "Java", "Scala", "R", "TypeScript", "CSS", "HTML", "SQL", "Latex"]
    },
    {
      "header": "Frameworky",
      "list": ["Spring Boot", "Next.js"]
    },
    {
      "header": "Nástroje",
      "list": ["Git", "Figma", "Docker", "Enterprise Architect"]
    },
    {
      "header": "Průkazy",
      "list": ["Řidičský průkaz B"]
    },
    {
      "header": "Jazyky",
      "list": ["Angličtina | plně profesionální znalost", "Čeština | rodilá mluvčí"]
    }
  ],

  "educationPage": [
    {
      "schoolName": "ČVUT FIT",
      "time": "2024 - 2026?",
      "description": "Magisterské studium v oboru Softwarové inženýrství",
      "adittional": "Zatím nedokončeno",
      "details": {
        "label": "Magisterské studium",
        "paragraphs": [
          "Toto studium je pro mě stále příliš čerstvé na to, abych mohla o něm blíže napsat. Každopádně doufám, že naplní má očekávání stejně jako bakalářské studium. Očekávám, že studia dokončím ve standartní době dvou let, tedy v roce 2026."
        ]
      }
    },
    {
      "schoolName": "ČVUT FIT",
      "time": "2021 - 2024",
      "description": "Bakalářské studium v oboru Softwarové inženýrství",
      "adittional": "Ukončeno s vyznamenáním",
      "details": {
        "label": "Bakalářské studium",
        "paragraphs": [
          "Zde jsem se naučila veškeré základy, na kterých jsem mohla dále stavět. FIT jako škola studenty vyloženě vybízí k samostudiu, které je prostě u takto obsáhlého oboru nevyhnutelné. Škola měla pro nás skvěle vytvořené materiály a mohu-li říct i logicky poskládané studijní programy.",
          "Naučila jsem se zde pracovat v programovacích jazycích jako je C/C++, Java, Scala, ale i v tak obskurních jazycích jako je Lambda kalkulus nebo Prolog. Konrkténě toto byla náplň mých semestrů na fakultě:"
        ],
        "semesters": [
          {
            "label": "1. semestr",
            "content": ["C", "Linux OS", "Skriptování v shellu", "Git"]
          },
          {
            "label": "2. semestr",
            "content": ["C++", "OOP design", "SQL databáze (Oracle, PostgreSQL)", "Assembler"]
          },
          {
            "label": "3. semestr",
            "content": ["DevOps", "Java", "Spring Boot", "Lambda kalkulus", "Prolog"]
          },
          {
            "label": "4. semestr",
            "content": [
              "Kryptografie",
              "Vícevláknové programování v C/C++",
              "SW týmový projekt",
              "UML modelování"
            ]
          },
          {
            "label": "5. semestr",
            "content": [
              "R",
              "Scala",
              "ALgoritmy a datové struktury",
              "Konceptuální modelování (OntoUML, BPMN, DEMO)"
            ]
          },
          {
            "label": "6. semestr",
            "content": ["Bakalářská práce (TypeScript, Next.js)", "Latex"]
          }
        ]
      }
    },
    {
      "schoolName": "Lidová konzervatoř a Múzická škola Ostrava",
      "time": "2018 - 2021",
      "description": "Výtvarný obor se zaměřením kresba, malba",
      "adittional": "Úspěšně ukončeno",
      "details": {
        "label": "Studium na konzervatoři",
        "paragraphs": [
          "Kreslení mě vždy bavilo a na gymnázium jsem bohužel neměla na toto téma žádný předmět. Proto jsem začala jednou týdně docházet na hodiny do lidové konzervatoře. Naučila jsem se práce s různými médii - s tužkou, pastelem, temperami, akvaralem, vodovými barvami, inkoustem. Také jsem se naučila koncepty jako je perspektiva, teorii barev a lidské proporce.",
          "I když se tyto znalosti nemusí zdát podstatné pro profesi programátorky, tak se mi kolikrát hodí kreativní způsob přemýšlení, které doplňuje jinak analytickou část."
        ]
      }
    },
    {
      "schoolName": "Gymnázium Ostrava-Hrabůvka",
      "time": "2017 - 2021",
      "description": "Všeobecné zaměření",
      "adittional": "Ukončeno s vyznamenáním",
      "details": {
        "label": "Studium na gymnázium",
        "paragraphs": [
          "V Ostravě jsem vystudovala gymnázium s všeobecným zaměřením, přičemž jeho osnovy byly spíše myšleny pro přírodovědné gymnázium. Na gymnázium jsem šla s jasným cílem a to, že jsem chtěla studovat na vysoké škole lékařství. Od toho jsem na poslední chvíli opustila.",
          "Nemůžu však říct, že bych si ze školy nic neodnesla. Naučila jsem se učit, vyprácovávat protokoly a prezentovat. Ze školy ráda vzpomínám na týmový projekt pro soutěž JA Studentská firma roku. Tehdy jsme vytvořili deskovou hru Eco-City, která měla za úkol jak zabavit, tak i vzdělat hráče o otázkách ekologie. Já jsem pro hru vytvořila všechny grafické designy. S týmem jsme vyhráli národní kolo této soutěže."
        ]
      }
    }
  ],

  "contactMePage": {
    "contactDialog": "Kontaktujte mě na email",
    "emailLabel": "Napište mi",
    "contactOnPage": {
      "label": "Nebo mi napište přímo zde",
      "form": {
        "textInput": {
          "label": "Váš email",
          "placeholder": "jan.novak@seznam.cz"
        },
        "textBoxInput": {
          "label": "Vaše zpráva",
          "placeholder": "Napište svou zprávu..."
        }
      },
      "submitLabel": "Odeslat"
    }
  }
}
